loadtest/evidencias/resultados-k6/vus-10-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/k6/smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m00.8s/1m0s

running (0m02.0s), 10/10 VUs, 4 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m01.8s/1m0s

running (0m03.0s), 10/10 VUs, 9 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m02.8s/1m0s

running (0m04.0s), 10/10 VUs, 16 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m03.8s/1m0s

running (0m05.0s), 10/10 VUs, 23 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m04.8s/1m0s

running (0m06.0s), 10/10 VUs, 29 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m05.8s/1m0s

running (0m07.0s), 10/10 VUs, 37 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m06.8s/1m0s

running (0m08.0s), 10/10 VUs, 46 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m07.8s/1m0s

running (0m09.0s), 10/10 VUs, 55 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m08.8s/1m0s

running (0m10.0s), 10/10 VUs, 64 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m09.8s/1m0s

running (0m11.0s), 10/10 VUs, 74 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m10.8s/1m0s

running (0m12.0s), 10/10 VUs, 83 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m11.8s/1m0s

running (0m13.0s), 10/10 VUs, 91 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  0m12.8s/1m0s

running (0m14.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m13.8s/1m0s

running (0m15.0s), 10/10 VUs, 108 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m14.8s/1m0s

running (0m16.0s), 10/10 VUs, 115 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  0m15.8s/1m0s

running (0m17.0s), 10/10 VUs, 124 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m16.8s/1m0s

running (0m18.0s), 10/10 VUs, 132 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m17.8s/1m0s

running (0m19.0s), 10/10 VUs, 139 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  0m18.8s/1m0s

running (0m20.0s), 10/10 VUs, 145 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m19.8s/1m0s

running (0m21.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  0m20.8s/1m0s

running (0m22.0s), 10/10 VUs, 158 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  0m21.8s/1m0s

running (0m23.0s), 10/10 VUs, 165 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  0m22.8s/1m0s

running (0m24.0s), 10/10 VUs, 172 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  0m23.8s/1m0s

running (0m25.0s), 10/10 VUs, 182 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  0m24.8s/1m0s

running (0m26.0s), 10/10 VUs, 189 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  0m25.8s/1m0s

running (0m27.0s), 10/10 VUs, 196 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  0m26.8s/1m0s

running (0m28.0s), 10/10 VUs, 206 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  0m27.8s/1m0s

running (0m29.0s), 10/10 VUs, 214 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  0m28.8s/1m0s

running (0m30.0s), 10/10 VUs, 221 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  0m29.8s/1m0s

running (0m31.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  0m30.8s/1m0s

running (0m32.0s), 10/10 VUs, 239 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  0m31.8s/1m0s

running (0m33.0s), 10/10 VUs, 246 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  0m32.8s/1m0s

running (0m34.0s), 10/10 VUs, 254 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  0m33.8s/1m0s

running (0m35.0s), 10/10 VUs, 263 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  0m34.8s/1m0s

running (0m36.0s), 10/10 VUs, 271 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  0m35.8s/1m0s

running (0m37.0s), 10/10 VUs, 279 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  0m36.8s/1m0s

running (0m38.0s), 10/10 VUs, 288 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  0m37.8s/1m0s

running (0m39.0s), 10/10 VUs, 297 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  0m38.8s/1m0s

running (0m40.0s), 10/10 VUs, 303 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  0m39.8s/1m0s

running (0m41.0s), 10/10 VUs, 309 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  0m40.8s/1m0s

running (0m42.0s), 10/10 VUs, 312 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  0m41.8s/1m0s

running (0m43.0s), 10/10 VUs, 321 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  0m42.8s/1m0s

running (0m44.0s), 10/10 VUs, 328 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  0m43.8s/1m0s

running (0m45.0s), 10/10 VUs, 336 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  0m44.8s/1m0s

running (0m46.0s), 10/10 VUs, 345 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  0m45.8s/1m0s

running (0m47.0s), 10/10 VUs, 353 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  0m46.8s/1m0s

running (0m48.0s), 10/10 VUs, 361 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  0m47.8s/1m0s

running (0m49.0s), 10/10 VUs, 369 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  0m48.8s/1m0s

running (0m50.0s), 10/10 VUs, 378 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  0m49.8s/1m0s

running (0m51.0s), 10/10 VUs, 387 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  0m50.8s/1m0s

running (0m52.0s), 10/10 VUs, 395 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  0m51.8s/1m0s

running (0m53.0s), 10/10 VUs, 404 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  0m52.8s/1m0s

running (0m54.0s), 10/10 VUs, 412 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  0m53.8s/1m0s

running (0m55.0s), 10/10 VUs, 421 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  0m54.8s/1m0s

running (0m56.0s), 10/10 VUs, 431 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  0m55.8s/1m0s

running (0m57.0s), 10/10 VUs, 441 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  0m56.8s/1m0s

running (0m58.0s), 10/10 VUs, 448 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  0m57.8s/1m0s

running (0m59.0s), 10/10 VUs, 455 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  0m58.8s/1m0s

running (1m00.0s), 10/10 VUs, 465 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  0m59.8s/1m0s

running (1m01.0s), 02/10 VUs, 473 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m02.0s), 02/10 VUs, 473 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m03.0s), 02/10 VUs, 473 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<1.0' rate=60.42%


  █ TOTAL RESULTS 

    checks_total.......: 1223    19.362464/s
    checks_succeeded...: 100.00% 1223 out of 1223
    checks_failed......: 0.00%   0 out of 1223

    ✓ login: status 200
    ✓ login: access_token presente
    ✓ get_patient_history: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_patient: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_patient_summary: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_my_patients: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_supervised_patients: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_cohort_statistics: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_cohort_exams: respondeu (2xx, 403 ou 429 são esperados)
    ✓ get_my_projects: respondeu (2xx, 403 ou 429 são esperados)

    CUSTOM
    auth_login_duration............: avg=50.54ms  min=44.27ms  med=50.07ms max=63.72ms p(90)=55.44ms  p(95)=59.58ms 
    gateway_denied_rate............: 11.65% 140 out of 1201
    gateway_error_rate.............: 0.00%  0 out of 1201
    gateway_rate_limited_rate......: 49.37% 593 out of 1201
    gateway_req_duration...........: avg=102.78ms min=502.29µs med=6.7ms   max=2.23s   p(90)=75ms     p(95)=196.51ms
    gateway_requests_total.........: 1201   19.014162/s
    login_error_rate...............: 0.00%  0 out of 11

    HTTP
    http_req_duration..............: avg=102.3ms  min=502.29µs med=6.83ms  max=2.23s   p(90)=75ms     p(95)=195.87ms
      { expected_response:true }...: avg=249.99ms min=5.73ms   med=18.82ms max=2.23s   p(90)=416.36ms p(95)=2.13s   
    http_req_failed................: 60.42% 733 out of 1213
    http_reqs......................: 1213   19.204145/s

    EXECUTION
    iteration_duration.............: avg=1.28s    min=1s       med=1.02s   max=8.19s   p(90)=3.04s    p(95)=3.16s   
    iterations.....................: 475    7.520172/s
    vus............................: 2      min=2           max=10
    vus_max........................: 10     min=10          max=10

    NETWORK
    data_received..................: 5.1 MB 80 kB/s
    data_sent......................: 2.1 MB 33 kB/s



running (1m03.2s), 00/10 VUs, 475 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  1m0s